{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_8"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "trainable": true, "name": "up_sampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "trainable": true, "name": "up_sampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "concatenate_3"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "trainable": true, "name": "up_sampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": -1}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]], "name": "concatenate_4"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "trainable": true, "name": "up_sampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.8, "center": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]], "name": "concatenate_5"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "interpolation": "nearest", "trainable": true, "name": "up_sampling2d_5", "size": [2, 2]}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_15"}], "input_layers": [["input_6", 0, 0]], "output_layers": [["conv2d_15", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}